worg/org-tutorials/index.org
# Created 2013-12-17 Tue 09:39
#+TITLE: Org tutorials
#+AUTHOR: Worg people
#+OPTIONS: H:3 num:nil toc:t \n:nil ::t |:t ^:t -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP: align fold nodlcheck hidestars oddeven lognotestate
#+SEQ_TODO: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS: Write(w) Update(u) Fix(f) Check(c) NEW(n)
#+LANGUAGE: en
#+PRIORITIES: A C B
#+CATEGORY: worg

[[file:../index.org][{Back to Worg's index}]]

#+INDEX: Tutorials

* General Introductions to Org-mode
- [[http://orgmode.org/talks/GoogleTech.html][Google Tech Talk about Org-mode]], a 45 minute talk given by Carsten
  Dominik during a visit at [[http://maps.google.com/%3Fq%3D37.423156,-122.084917%2B(Google%20Inc.)&hl%3Den][Google]].

- [[http://www.nf.mpg.de/orgmode/guest-talk-dominik.html][Organizing a Scientist's Life and Work]], a 45 minute talk given by
  Carsten Dominik during a visit at the [[http://www.nf.mpg.de/][Max-Planck Institute for
  neurological Research Cologne]].

- On [[http://twit.tv/floss136][FLOSS Weekly Episode 136]] (Audio+Video download available) 
  Randal Schwartz interviews Carsten Dominik about Org-mode.

- [[http://orgmode.org/worg/org-tutorials/org-screencasts/ghm2011-demo.html][Emacs Org-mode presentation at GNU Hackers Meeting 2011 in Paris]] (in
  English), by Bastien Guerry.

- [[http://www.linuxjournal.com/article/9116][Getting Organized with Emacs Org-mode]] by [[http://www.planetizen.com/user/2][Abhijeet Chavan]], an article
  originally published in the [[http://www.linuxjournal.com/][Linux Journal]].

- [[file:OrgTutorial.cn.html][Org-Mode简明教程]] 作者是[[http://dto.freeshell.org/notebook/][David O'Toole]], 囊括待办事项和agenda的基本使用。
目前的译本有[[file:orgtutorial_dto-fr.org][法语、]][[http://hpcgi1.nifty.com/spen/index.cgi?OrgMode%2fOrgTutorial][日语]]、[[file:orgtutorial_dto-es.org][西班牙语、]][[http://hokmen.chan.googlepages.com/OrgTutorial.en-cn.html][汉语]]、[[http://jmjeong.com/index.php?display=Emacs/OrgMode][韩语、]][[http://habrahabr.ru/blogs/emacs/105300/][俄语]]和[[http://deneb.iszt.hu/~pasztor/orgtutorial/notebook/orgtutorial-hu.html][Hungarian]]。

- [[http://jaderholm.com/screencasts.html][A 25 minute screencast]] by [[http://jaderholm.com][Scott Jaderholm]], demonstrating the basic
  features of Org-mode.

- [[http://sachachua.com/wp/2008/01/18/outlining-your-notes-with-org/][Outlining Your Notes with Org]] by [[http://sachachua.com/wp/][Sacha Chua]] covers outlining,
  searching and internal links.

- [[http://members.optusnet.com.au/~charles57/GTD/orgmode.html][Using Emacs org-mode for GTD]] by [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]] contains an
  introduction into Org-mode, among other things.  Charles has also
  written a more extensive document ([[id:50A0DEB1-4B63-4CC4-840E-313615C4BAE3][see below]]), but here we still
  link to the earlier version because of its nice overview over
  Org-mode.

- Emacs Org-mode, [[http://article.gmane.org/gmane.emacs.orgmode/8547][video version of a 2-hour talk]] by Russell Adams at
  the [[http://www.hlug.org/][Houston Linux User Group]].  The first half of the first hour is
  /not/ about Org-mode, but about the Linux command =xargs=.

- [[https://github.com/novoid/org-mode-workshop/blob/master/featureshow/org-mode-teaser.org][Demonstration of Org-mode features]] by Karl Voit, presented for the
  first time at [[http://glt12-programm.linuxtage.at/events/96.de.html][Grazer Linuxtage 2012]].

- [[https://github.com/novoid/org-mode-workshop][Org-mode Workshop]] by Karl Voit, conducted at [[http://www.TUGraz.at][Graz University of
  Technology]] in November 2012 (3x4 hours). It includes a newer version
  of the feature-show from the entry above.

- [[file:org-outside-org.org][Org-mode outside Org-mode]] by Thorsten Jolitz and François Pinard. An
  introduction to the available libraries for using Org-mode's concepts and
  Org-mode's functionality outside of Org-mode files, e.g. when working with
  programming-language source-code files.

- /In German language:/ [[ftp://ftp.freiesmagazin.de/2009/freiesMagazin-2009-10.pdf][Ordnung ins Chaos mit Org-Mode]], an excellent
  introduction into Org-mode, by Rainer Koenig, published in the free
  electronic journal [[http://www.freiesmagazin.de/][Freies Magazin]].

- /In French:/ A [[http://www.olivierberger.com/weblog/index.php?post/2010/08/14/Ma-vie-a-chang%C3%A9-%3A-j-utilise-org-mode][general introduction]] on Org for the "[[http://lifehacking.fr][lifehacking]]"
  group, by Olivier Berger.

- /In German:/ [[http://www.suenkler.info/emacs-orgmode.html][Der Emacs Org mode]], a comprehensive blog post about Org-mode, by
  Hendrik Sünkler.

- /In Spanish:/ [[file:org-reference-guide-es.org][A reference guide]] of each features, their text format and their available keys.
* Power users describe their setup
#+INDEX: Setup

In the following documents, the authors describe the details of
their setup, along with the workflows they use to get organized with
Org-mode.  While as a beginner you probably should start with only a
simple setup, these descriptions will be a fantastic source of
inspiration once you start growing your use of Org-mode.

- [[http://www.newartisans.com/2007/08/using-org-mode-as-a-day-planner.html][Using Org-mode as a day planner]] by [[http://johnwiegley.com][John Wiegley]] shows how to use
  Org-mode after the fashion of a pen-and-paper day planner.

- [[http://members.optusnet.com.au/~charles57/GTD/gtd_workflow.html][How I use Emacs and Org-mode to implement GTD]] by [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]]
  shows one method of doing GTD with org-mode and covers (among
  other things) categories, effort estimates, tags, scheduling, and
  custom agenda commands.

- [[http://doc.norang.ca/org-mode.html][Organize Your Life In Plain Text!]] by Bernt Hansen describes how to
  use Org-mode to track and clock everything you work on.
* Tutorials on specific features
** Lists

- A short [[http://bzg.fr/org-playing-with-lists-screencast.html][screencast]] presenting a few features of plain lists, by
  Bastien.
