worg/en/org-tutorials/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org tutorials</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Org tutorials"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-17T18:27+0800"/>
<meta name="author" content="Worg people"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Org tutorials</h1>

<p><a href="../index.html">{Back to Worg's index}</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">General Introductions to Org-mode</a></li>
<li><a href="#sec-2">Power users describe their setup</a></li>
<li><a href="#sec-3">Tutorials on specific features</a>
<ul>
<li><a href="#sec-3-1">Lists</a></li>
<li><a href="#sec-3-2">Tables, Spreadsheet, Plotting</a></li>
<li><a href="#sec-3-3">Dates and Times</a></li>
<li><a href="#sec-3-4">Tags, Properties, and Column View</a></li>
<li><a href="#sec-3-5">Remember</a></li>
<li><a href="#sec-3-6">Capture</a></li>
<li><a href="#sec-3-7">Agenda and search</a></li>
<li><a href="#sec-3-8">Customization</a></li>
<li><a href="#sec-3-9">Export and Publishing</a></li>
<li><a href="#sec-3-10">Reproducible research</a></li>
<li><a href="#sec-3-11">Import</a></li>
</ul>
</li>
<li><a href="#sec-4">Special tasks</a>
<ul>
<li><a href="#sec-4-1">Natural Project Planning</a></li>
<li><a href="#sec-4-2">Tracking Habits</a></li>
<li><a href="#sec-4-3">Measuring Personal Effectiveness</a></li>
<li><a href="#sec-4-4">Using version Control with Your org files</a></li>
<li><a href="#sec-4-5">How to use jsMath with org-mode</a></li>
<li><a href="#sec-4-6">Creating a Blog with Jekyll and org</a></li>
<li><a href="#sec-4-7">Creating Beamer presentations</a></li>
<li><a href="#sec-4-8">Creating Non-Beamer presentations</a></li>
<li><a href="#sec-4-9">Keeping up with your team's tasks</a></li>
<li><a href="#sec-4-10">Tracking tasks through a series of meetings</a></li>
</ul>
</li>
<li><a href="#sec-5">Personal Setup</a></li>
<li><a href="#sec-6">Screencasts</a></li>
<li><a href="#sec-7">Features waiting for tutorials</a></li>
<li><a href="#sec-8">Org-related pages by Tutorial authors</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">General Introductions to Org-mode</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://orgmode.org/talks/GoogleTech.html">Google Tech Talk about Org-mode</a>, a 45 minute talk given by Carsten
  Dominik during a visit at <a href="http://maps.google.com/?q=37.423156,-122.084917+(Google Inc.)&amp;hl=en">Google</a>.

</li>
<li><a href="http://www.nf.mpg.de/orgmode/guest-talk-dominik.html">Organizing a Scientist's Life and Work</a>, a 45 minute talk given by
  Carsten Dominik during a visit at the <a href="http://www.nf.mpg.de/">Max-Planck Institute for neurological Research Cologne</a>.

</li>
<li>On <a href="http://twit.tv/floss136">FLOSS Weekly Episode 136</a> (Audio+Video download available) 
  Randal Schwartz interviews Carsten Dominik about Org-mode.

</li>
<li><a href="http://orgmode.org/worg/org-tutorials/org-screencasts/ghm2011-demo.html">Emacs Org-mode presentation at GNU Hackers Meeting 2011 in Paris</a> (in
  English), by Bastien Guerry.

</li>
<li><a href="http://www.linuxjournal.com/article/9116">Getting Organized with Emacs Org-mode</a> by <a href="http://www.planetizen.com/user/2">Abhijeet Chavan</a>, an article
  originally published in the <a href="http://www.linuxjournal.com/">Linux Journal</a>.

</li>
<li><a href="orgtutorial_dto.html">The OrgMode tutorial</a> by <a href="http://dto.freeshell.org/notebook/">David O'Toole</a>, covering the basics of TODO
  lists and the agenda.  It has been translated into <a href="orgtutorial_dto-fr.html">French</a>, <a href="http://hpcgi1.nifty.com/spen/index.cgi?OrgMode/OrgTutorial">Japanese</a>,
  <a href="orgtutorial_dto-es.html">Spanish</a>, <a href="http://hokmen.chan.googlepages.com/OrgTutorial.en-cn.html">Chinese</a>, <a href="http://jmjeong.com/index.php?display=Emacs/OrgMode">Korean</a>, <a href="http://habrahabr.ru/blogs/emacs/105300/">Russian</a> and <a href="http://deneb.iszt.hu/~pasztor/orgtutorial/notebook/orgtutorial-hu.html">Hungarian</a>.

</li>
<li><a href="http://jaderholm.com/screencasts.html">A 25 minute screencast</a> by <a href="http://jaderholm.com">Scott Jaderholm</a>, demonstrating the basic
  features of Org-mode.

</li>
<li><a href="http://sachachua.com/wp/2008/01/18/outlining-your-notes-with-org/">Outlining Your Notes with Org</a> by <a href="http://sachachua.com/wp/">Sacha Chua</a> covers outlining,
  searching and internal links.

</li>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/orgmode.html">Using Emacs org-mode for GTD</a> by <a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a> contains an
  introduction into Org-mode, among other things.  Charles has also
  written a more extensive document (<a href="#id-50A0DEB1-4B63-4CC4-840E-313615C4BAE3">see below</a>), but here we still
  link to the earlier version because of its nice overview over
  Org-mode.

</li>
<li>Emacs Org-mode, <a href="http://article.gmane.org/gmane.emacs.orgmode/8547">video version of a 2-hour talk</a> by Russell Adams at
  the <a href="http://www.hlug.org/">Houston Linux User Group</a>.  The first half of the first hour is
  <i>not</i> about Org-mode, but about the Linux command <code>xargs</code>.

</li>
<li><a href="https://github.com/novoid/org-mode-workshop/blob/master/featureshow/org-mode-teaser.org">Demonstration of Org-mode features</a> by Karl Voit, presented for the
  first time at <a href="http://glt12-programm.linuxtage.at/events/96.de.html">Grazer Linuxtage 2012</a>.

</li>
<li><a href="https://github.com/novoid/org-mode-workshop">Org-mode Workshop</a> by Karl Voit, conducted at <a href="http://www.TUGraz.at">Graz University of Technology</a> in November 2012 (3x4 hours). It includes a newer version
  of the feature-show from the entry above.

</li>
<li><a href="org-outside-org.html">Org-mode outside Org-mode</a> by Thorsten Jolitz and François Pinard. An
  introduction to the available libraries for using Org-mode's concepts and
  Org-mode's functionality outside of Org-mode files, e.g. when working with
  programming-language source-code files.

</li>
<li><i>In German language:</i> <a href="ftp://ftp.freiesmagazin.de/2009/freiesMagazin-2009-10.pdf">Ordnung ins Chaos mit Org-Mode</a>, an excellent
  introduction into Org-mode, by Rainer Koenig, published in the free
  electronic journal <a href="http://www.freiesmagazin.de/">Freies Magazin</a>.

</li>
<li><i>In French:</i> A <a href="http://www.olivierberger.com/weblog/index.php?post/2010/08/14/Ma-vie-a-changé-:-j-utilise-org-mode">general introduction</a> on Org for the "<a href="http://lifehacking.fr">lifehacking</a>"
  group, by Olivier Berger.

</li>
<li><i>In German:</i> <a href="http://www.suenkler.info/emacs-orgmode.html">Der Emacs Org mode</a>, a comprehensive blog post about Org-mode, by
  Hendrik Sünkler.

</li>
<li><i>In Spanish:</i> <a href="org-reference-guide-es.html">A reference guide</a> of each features, their text format and their available keys.
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Power users describe their setup</h2>
<div class="outline-text-2" id="text-2">


<p>
In the following documents, the authors describe the details of
their setup, along with the workflows they use to get organized with
Org-mode.  While as a beginner you probably should start with only a
simple setup, these descriptions will be a fantastic source of
inspiration once you start growing your use of Org-mode.
</p>
<ul>
<li><a href="http://www.newartisans.com/2007/08/using-org-mode-as-a-day-planner.html">Using Org-mode as a day planner</a> by <a href="http://johnwiegley.com">John Wiegley</a> shows how to use
  Org-mode after the fashion of a pen-and-paper day planner.

</li>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/gtd_workflow.html">How I use Emacs and Org-mode to implement GTD</a> by <a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a>
  shows one method of doing GTD with org-mode and covers (among
  other things) categories, effort estimates, tags, scheduling, and
  custom agenda commands.

</li>
<li><a href="http://doc.norang.ca/org-mode.html">Organize Your Life In Plain Text!</a> by Bernt Hansen describes how to
  use Org-mode to track and clock everything you work on.
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Tutorials on specific features</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Lists</h3>
<div class="outline-text-3" id="text-3-1">


<ul>
<li>A short <a href="http://bzg.fr/org-playing-with-lists-screencast.html">screencast</a> presenting a few features of plain lists, by
  Bastien.
</li>
</ul>

</div>

</div>
