worg/org-tutorials/index.org
** Tables, Spreadsheet, Plotting
- [[file:tables.org][A very short introduction to tables in Org-mode]], by Bastien.

- [[file:org-spreadsheet-intro.org][A very short introduction to Org as a spreadsheet system]], by
  Bastien.

- [[file:org-spreadsheet-lisp-formulas.org][Using Emacs lisp for spreadsheet formulas]] ([[file:org-tableur-tutoriel.org][french version]]), by Bastien.

- [[https://github.com/novoid/org-mode-workshop/blob/master/featureshow/org-mode-teaser.org#1131-referencing-example-with-detailed-explanation][Various spreadsheet formulas with explanations how they work]]
  by Karl Voit.

- [[file:org-plot.org][Plotting tables in Org-Mode using org-plot]] by Eric Schulte

- [[file:org-dot-diagrams.org][Plotting process diagrams or work flows in Org-Mode using dot]] by Karl Voit

- [[http://www.youtube.com/watch?v=EQAd41VAXWo][Can your editor do this]], awesome little video showing how to create
  HTML tables from an embedded Org-mode table.

- [[file:multitarget-tables.org][Using multiple-target tables and general formatting functions]] by
    [[http://claimid.com/ejr/][Jason Riedy]].

- [[http://www.hollenback.net/index.php/EmacsOrgTimestamps][Timestamps in Org and Calc]], how to calculate and display times in Org-mode by Phil Hollenback

- [[file:org-lookups.org][Table lookup functions]] by Jarmo Hurri

- The following are not tutorials but listed here somehow for
  "completeness" of the information sources to be checked too:
  - [[http://orgmode.org/manual/The-spreadsheet.html][Org manual, section about spreadsheet]]

  - [[http://orgmode.org/worg/org-faq.html#Tables][Worg FAQ, section about tables]]

  - [[http://orgmode.org/worg/org-hacks.html#Tables][Worg hacks, section about tables]]

  - [[http://orgmode.org/w/org-mode.git?p=org-mode.git;a=blob;f=testing/lisp/test-org-table.el;hb=HEAD][most of the automated Emacs Regression Tests (ERT) for Org tables]]
** Dates and Times

- [[http://members.optusnet.com.au/~charles57/GTD/org_dates/][Using Dates and Times in Emacs Org-mode]] by [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]].

- [[http://sachachua.com/wp/2007/12/30/clocking-time-with-emacs-org/][Clocking time with Emacs Org]] by [[http://sachachua.com/wp/][Sacha Chua]].
** Tags, Properties, and Column View

- [[http://sachachua.com/wp/2008/01/04/tagging-in-org-plus-bonus-code-for-timeclocks-and-tags/][Tagging in Org]] by [[http://sachachua.com/wp/][Sacha Chua]].

- [[http://thread.gmane.org/gmane.emacs.orgmode/5107/focus%3D5134][What's the use of Column View?]] by Christian Egli is a short tutorial
  about Column View that was sent to [[http://news.gmane.org/gmane.emacs.orgmode][emacs-orgmode@gnu.org]].

- [[file:org-column-view-tutorial.org][Emacs Org's Column View]] by [[http://www.cognition.ens.fr/~guerry/][Bastien]], with an accompanying [[http://www.cognition.ens.fr/~guerry/org-column-screencast.php][screencast]].
** Remember

- [[http://members.optusnet.com.au/~charles57/GTD/remember.html][Remember mode tutorial]] by [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]].

- [[http://sachachua.com/wp/2007/10/05/remembering-to-org-and-planner/][Remembering to Org and Planner]] by [[http://sachachua.com/wp/][Sacha Chua]].
** Capture

- [[file:org-protocol-custom-handler.org][Defining custom handlers for use with org-protocol]] by Sebastian Rose

- [[http://members.optusnet.com.au/~charles57/GTD/datetree.html][Capture mode  and date trees in org-mode]] by [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]].
** Agenda and search

- [[file:org-custom-agenda-commands.org][Using custom agenda commands]] by Matt Lundin

- [[file:advanced-searching.org][Advanced searching]] by Matt Lundin

- [[file:../agenda-optimization.org][Agenda speed up and optimization]] by Bastien

- [[file:agenda-filters.org][Agenda filters and limits]] by Bastien
** Customization

- [[file:org-customize.org][Using customize to find and set options]] by Carsten Dominik.
- [[file:org-appearance.org][Customizing Org appearance]]
** Export and Publishing

- [[file:org-publish-html-tutorial.org][Publishing Org-mode files to HTML]], covering the basics of publishing
  to HTML, by Sebastian Rose.
- [[file:org-publish-layersmenu.org][Phplayersmenu and HTML publishing]], shows how to create and maintain JavaScript
  menus (Phplayermenu) for HTML export, by Sebastian Rose.
- [[file:images-and-xhtml-export.org][Images and XHTML export]], shows simple image handling in HTML export, by
  Sebastian Rose.
- [[file:org-taskjuggler.org][Creating Gantt charts by exporting to TaskJuggler]], explains the usage of
  the TaskJuggler exporter.  There is a Serbo-Croatian translation [[file:org-taskjuggler-scr.org][here]] by
  Jovana Milutinovich.
- [[file:org-latex-export.org][Using the OLD LaTeX exporter]] introduces configuration topics for
  users of Org Mode < 8.0.
- [[file:org-latex-preview.org][Some notes on previewing LaTeX fragments]].
- [[file:org-google-sync.org][Syncing with Google Calendar]]
- [[http://www.youtube.com/watch?v=1-dUkyn_fZA][Demonstration of Org-mode as a tool for reproducible research]] by John Kitchin
  at SciPy 2013.
** Reproducible research
A talk by [[http://www.cheme.cmu.edu/people/faculty/jkitchin.htm][John Kitchin]] at [[http://conference.scipy.org/scipy2013/][SciPy 2013]]. In his truely amazing talk
[[http://www.youtube.com/watch?v%3D1-dUkyn_fZA][Emacs + org-mode + python in reproducible research]], John shows off
the capabilities of Org mode for reproducible research and
authoring.  This may be the best demonstration yet on this subject.

** Import

- [[file:org-import-rtm.org][Importing from remember the milk]]
* Special tasks
** Natural Project Planning

- [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]] about using Org-mode to implement [[http://members.optusnet.com.au/~charles57/GTD/Natural_Project_Planning.html][Natural Project
  Planning]] according to David Allen.
** Tracking Habits

- [[file:tracking-habits.org][Tracking habits with org-mode]], by Matt Lundin.
** Measuring Personal Effectiveness
- [[file:org-effectiveness.org][Org Effectiveness Tutorial]]

** Using version Control with Your org files
- [[file:org-vcs.org][Using version control with your org files]], by Ian Barton.
- Use [[https://github.com/simonthum/git-sync][git-sync]] (disclaimer: my script) if you have a git repo of your own
  somewhere in the interclouds.
- Use [[http://git-annex.branchable.com/sync/][git-annex]] for even more decentralized sync and/or heavier workloads.

