worg/en/org-tutorials/index.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Tables, Spreadsheet, Plotting</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li><a href="tables.html">A very short introduction to tables in Org-mode</a>, by Bastien.

</li>
<li><a href="org-spreadsheet-intro.html">A very short introduction to Org as a spreadsheet system</a>, by
  Bastien.

</li>
<li><a href="org-spreadsheet-lisp-formulas.html">Using Emacs lisp for spreadsheet formulas</a> (<a href="org-tableur-tutoriel.html">french version</a>), by Bastien.

</li>
<li><a href="https://github.com/novoid/org-mode-workshop/blob/master/featureshow/org-mode-teaser.org#1131-referencing-example-with-detailed-explanation">Various spreadsheet formulas with explanations how they work</a>
  by Karl Voit.

</li>
<li><a href="org-plot.html">Plotting tables in Org-Mode using org-plot</a> by Eric Schulte

</li>
<li><a href="org-dot-diagrams.html">Plotting process diagrams or work flows in Org-Mode using dot</a> by Karl Voit

</li>
<li><a href="http://www.youtube.com/watch?v=EQAd41VAXWo">Can your editor do this</a>, awesome little video showing how to create
  HTML tables from an embedded Org-mode table.

</li>
<li><a href="multitarget-tables.html">Using multiple-target tables and general formatting functions</a> by
    <a href="http://claimid.com/ejr/">Jason Riedy</a>.

</li>
<li><a href="http://www.hollenback.net/index.php/EmacsOrgTimestamps">Timestamps in Org and Calc</a>, how to calculate and display times in Org-mode by Phil Hollenback

</li>
<li><a href="org-lookups.html">Table lookup functions</a> by Jarmo Hurri

</li>
<li>The following are not tutorials but listed here somehow for
  "completeness" of the information sources to be checked too:
<ul>
<li><a href="http://orgmode.org/manual/The-spreadsheet.html">Org manual, section about spreadsheet</a>

</li>
<li><a href="http://orgmode.org/worg/org-faq.html#Tables">Worg FAQ, section about tables</a>

</li>
<li><a href="http://orgmode.org/worg/org-hacks.html#Tables">Worg hacks, section about tables</a>

</li>
<li><a href="http://orgmode.org/w/org-mode.git?p=org-mode.git;a=blob;f=testing/lisp/test-org-table.el;hb=HEAD">most of the automated Emacs Regression Tests (ERT) for Org tables</a>
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Dates and Times</h3>
<div class="outline-text-3" id="text-3-3">


<ul>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/org_dates/">Using Dates and Times in Emacs Org-mode</a> by <a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a>.

</li>
<li><a href="http://sachachua.com/wp/2007/12/30/clocking-time-with-emacs-org/">Clocking time with Emacs Org</a> by <a href="http://sachachua.com/wp/">Sacha Chua</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Tags, Properties, and Column View</h3>
<div class="outline-text-3" id="text-3-4">


<ul>
<li><a href="http://sachachua.com/wp/2008/01/04/tagging-in-org-plus-bonus-code-for-timeclocks-and-tags/">Tagging in Org</a> by <a href="http://sachachua.com/wp/">Sacha Chua</a>.

</li>
<li><a href="http://thread.gmane.org/gmane.emacs.orgmode/5107/focus=5134">What's the use of Column View?</a> by Christian Egli is a short tutorial
  about Column View that was sent to <a href="http://news.gmane.org/gmane.emacs.orgmode">emacs-orgmode@gnu.org</a>.

</li>
<li><a href="org-column-view-tutorial.html">Emacs Org's Column View</a> by <a href="http://www.cognition.ens.fr/~guerry/">Bastien</a>, with an accompanying <a href="http://www.cognition.ens.fr/~guerry/org-column-screencast.php">screencast</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Remember</h3>
<div class="outline-text-3" id="text-3-5">


<ul>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/remember.html">Remember mode tutorial</a> by <a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a>.

</li>
<li><a href="http://sachachua.com/wp/2007/10/05/remembering-to-org-and-planner/">Remembering to Org and Planner</a> by <a href="http://sachachua.com/wp/">Sacha Chua</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Capture</h3>
<div class="outline-text-3" id="text-3-6">


<ul>
<li><a href="org-protocol-custom-handler.html">Defining custom handlers for use with org-protocol</a> by Sebastian Rose

</li>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/datetree.html">Capture mode  and date trees in org-mode</a> by <a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Agenda and search</h3>
<div class="outline-text-3" id="text-3-7">


<ul>
<li><a href="org-custom-agenda-commands.html">Using custom agenda commands</a> by Matt Lundin

</li>
<li><a href="advanced-searching.html">Advanced searching</a> by Matt Lundin

</li>
<li><a href="../agenda-optimization.html">Agenda speed up and optimization</a> by Bastien

</li>
<li><a href="agenda-filters.html">Agenda filters and limits</a> by Bastien
</li>
</ul>

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">Customization</h3>
<div class="outline-text-3" id="text-3-8">


<ul>
<li><a href="org-customize.html">Using customize to find and set options</a> by Carsten Dominik.
</li>
<li><a href="org-appearance.html">Customizing Org appearance</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">Export and Publishing</h3>
<div class="outline-text-3" id="text-3-9">


<ul>
<li><a href="org-publish-html-tutorial.html">Publishing Org-mode files to HTML</a>, covering the basics of publishing
  to HTML, by Sebastian Rose.
</li>
<li><a href="org-publish-layersmenu.html">Phplayersmenu and HTML publishing</a>, shows how to create and maintain JavaScript
  menus (Phplayermenu) for HTML export, by Sebastian Rose.
</li>
<li><a href="images-and-xhtml-export.html">Images and XHTML export</a>, shows simple image handling in HTML export, by
  Sebastian Rose.
</li>
<li><a href="org-taskjuggler.html">Creating Gantt charts by exporting to TaskJuggler</a>, explains the usage of
  the TaskJuggler exporter.  There is a Serbo-Croatian translation <a href="org-taskjuggler-scr.html">here</a> by
  Jovana Milutinovich.
</li>
<li><a href="org-latex-export.html">Using the OLD LaTeX exporter</a> introduces configuration topics for
  users of Org Mode &lt; 8.0.
</li>
<li><a href="org-latex-preview.html">Some notes on previewing LaTeX fragments</a>.
</li>
<li><a href="org-google-sync.html">Syncing with Google Calendar</a>
</li>
<li><a href="http://www.youtube.com/watch?v=1-dUkyn_fZA">Demonstration of Org-mode as a tool for reproducible research</a> by John Kitchin
  at SciPy 2013.
</li>
</ul>

</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">Reproducible research</h3>
<div class="outline-text-3" id="text-3-10">

<p>A talk by <a href="http://www.cheme.cmu.edu/people/faculty/jkitchin.htm">John Kitchin</a> at <a href="http://conference.scipy.org/scipy2013/">SciPy 2013</a>. In his truely amazing talk
<a href="http://www.youtube.com/watch?v=1-dUkyn_fZA">Emacs + org-mode + python in reproducible research</a>, John shows off
the capabilities of Org mode for reproducible research and
authoring.  This may be the best demonstration yet on this subject.
</p>
</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11">Import</h3>
<div class="outline-text-3" id="text-3-11">


<ul>
<li><a href="org-import-rtm.html">Importing from remember the milk</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Special tasks</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Natural Project Planning</h3>
<div class="outline-text-3" id="text-4-1">


<ul>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a> about using Org-mode to implement <a href="http://members.optusnet.com.au/~charles57/GTD/Natural_Project_Planning.html">Natural Project Planning</a> according to David Allen.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Tracking Habits</h3>
<div class="outline-text-3" id="text-4-2">


<ul>
<li><a href="tracking-habits.html">Tracking habits with org-mode</a>, by Matt Lundin.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Measuring Personal Effectiveness</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li><a href="org-effectiveness.html">Org Effectiveness Tutorial</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">Using version Control with Your org files</h3>
<div class="outline-text-3" id="text-4-4">

<ul>
<li><a href="org-vcs.html">Using version control with your org files</a>, by Ian Barton.
</li>
<li>Use <a href="https://github.com/simonthum/git-sync">git-sync</a> (disclaimer: my script) if you have a git repo of your own
  somewhere in the interclouds.
</li>
<li>Use <a href="http://git-annex.branchable.com/sync/">git-annex</a> for even more decentralized sync and/or heavier workloads.
</li>
</ul>


</div>

</div>
