worg/org-tutorials/index.org
** How to use jsMath with org-mode
- [[file:org-jsmath.org][How to use jsMath with org-mode]], by Darlan Cavalcante Moreira.
** Creating a Blog with Jekyll and org
- How to create a [[file:org-jekyll.org][blog]] with Jekyll.
** Creating Beamer presentations

- Here is a [[file:org-beamer/tutorial.org][tutorial]], by Eric S. Fraga.
- Also available is a [[http://www.youtube.com/watch?v=Ho6nMWGtepY&feature=player_embedded][YouTube video]] by Shulei Zhu, demonstrating the
  whole process.

** Creating Non-Beamer presentations

- A simple [[file:non-beamer-presentations.org][tutorial]] by Eric Schulte
** Keeping up with your team's tasks
A setup that makes it easy to [[http://juanreyero.com/article/emacs/org-teams.html][keep up with the work]] of several
people, packaged as org-secretary.el in contrib.

** Tracking tasks through a series of meetings
This tutorial describes a workflow for running a series of
meetings, for example of a commission or any other group, and for
keeping track of the groups tasks.  [[file:org-meeting-tasks.org][Link to the tutorial]].
* Personal Setup

See also [[id:50A0DEB1-4B63-4CC4-840E-313615C4BAE3][Powerusers describe their setup]]

- [[http://sachachua.com/wp/][Sacha Chua]] about [[http://sachachua.com/wp/2007/12/22/a-day-in-a-life-with-org/][A day in a life with Org]] and about the basics of
      [[http://sachachua.com/wp/2007/12/28/emacs-getting-things-done-with-org-basic/][Getting Things Done with Org]]

- David O'Toole explains his setup in [[http://thread.gmane.org/gmane.emacs.orgmode/4832][this post]].

- This [[http://www.brool.com/?p=82][blog post]] shows a very simple and clear GTD setup.

- Manuel Hermenegildo describes his [[http://thread.gmane.org/gmane.emacs.orgmode/6701/focus%3D6732][Setup for collaborative work
  using Org]].

- Jan Böcker describes his approach to [[http://www.jboecker.de/2010/04/14/general-reference-filing-with-org-mode.html][general reference filing]] with
  org-mode.
* Screencasts

See the [[file:org-screencasts/index.org][Screencasts]] page for a complete list of Org-mode screencasts.
* Features waiting for tutorials

- The Clock Table
- Sparse Trees
- Hyperlinks
- Using TODO states
- Using TAGS
- Embedded LaTeX
- Using orgtbl-mode in LaTeX
- Capture
* Org-related pages by Tutorial authors

Here are the pages of a number of people that write for or about
Org-mode:

- [[http://www.newartisans.com][John Wiegley]]

- [[http://members.optusnet.com.au/~charles57/GTD/][Charles Cave]]

- [[http://sachachua.com/wp/][Sacha Chua]]

- [[http://www.cognition.ens.fr/~guerry/][Bastien Guerry]]

# Emacs 24.2.50.1 (Org mode 8.2.4)
