worg/en/org-tutorials/index.html

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">How to use jsMath with org-mode</h3>
<div class="outline-text-3" id="text-4-5">

<ul>
<li><a href="org-jsmath.html">How to use jsMath with org-mode</a>, by Darlan Cavalcante Moreira.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6">Creating a Blog with Jekyll and org</h3>
<div class="outline-text-3" id="text-4-6">

<ul>
<li>How to create a <a href="org-jekyll.html">blog</a> with Jekyll.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7">Creating Beamer presentations</h3>
<div class="outline-text-3" id="text-4-7">


<ul>
<li>Here is a <a href="org-beamer/tutorial.html">tutorial</a>, by Eric S. Fraga.
</li>
<li>Also available is a <a href="http://www.youtube.com/watch?v=Ho6nMWGtepY&amp;feature=player_embedded">YouTube video</a> by Shulei Zhu, demonstrating the
  whole process.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8">Creating Non-Beamer presentations</h3>
<div class="outline-text-3" id="text-4-8">


<ul>
<li>A simple <a href="non-beamer-presentations.html">tutorial</a> by Eric Schulte
</li>
</ul>

</div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9">Keeping up with your team's tasks</h3>
<div class="outline-text-3" id="text-4-9">

<p>A setup that makes it easy to <a href="http://juanreyero.com/article/emacs/org-teams.html">keep up with the work</a> of several
people, packaged as org-secretary.el in contrib.
</p>
</div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10">Tracking tasks through a series of meetings</h3>
<div class="outline-text-3" id="text-4-10">

<p>This tutorial describes a workflow for running a series of
meetings, for example of a commission or any other group, and for
keeping track of the groups tasks.  <a href="org-meeting-tasks.html">Link to the tutorial</a>.
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Personal Setup</h2>
<div class="outline-text-2" id="text-5">


<p>
See also <a href="#id-50A0DEB1-4B63-4CC4-840E-313615C4BAE3">Powerusers describe their setup</a>
</p>
<ul>
<li><a href="http://sachachua.com/wp/">Sacha Chua</a> about <a href="http://sachachua.com/wp/2007/12/22/a-day-in-a-life-with-org/">A day in a life with Org</a> and about the basics of
      <a href="http://sachachua.com/wp/2007/12/28/emacs-getting-things-done-with-org-basic/">Getting Things Done with Org</a>

</li>
<li>David O'Toole explains his setup in <a href="http://thread.gmane.org/gmane.emacs.orgmode/4832">this post</a>.

</li>
<li>This <a href="http://www.brool.com/?p=82">blog post</a> shows a very simple and clear GTD setup.

</li>
<li>Manuel Hermenegildo describes his <a href="http://thread.gmane.org/gmane.emacs.orgmode/6701/focus=6732">Setup for collaborative work using Org</a>.

</li>
<li>Jan Böcker describes his approach to <a href="http://www.jboecker.de/2010/04/14/general-reference-filing-with-org-mode.html">general reference filing</a> with
  org-mode.
</li>
</ul>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Screencasts</h2>
<div class="outline-text-2" id="text-6">


<p>
See the <a href="org-screencasts/index.html">Screencasts</a> page for a complete list of Org-mode screencasts.
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Features waiting for tutorials</h2>
<div class="outline-text-2" id="text-7">


<ul>
<li>The Clock Table
</li>
<li>Sparse Trees
</li>
<li>Hyperlinks
</li>
<li>Using TODO states
</li>
<li>Using TAGS
</li>
<li>Embedded LaTeX
</li>
<li>Using orgtbl-mode in LaTeX
</li>
<li>Capture
</li>
</ul>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Org-related pages by Tutorial authors</h2>
<div class="outline-text-2" id="text-8">


<p>
Here are the pages of a number of people that write for or about
Org-mode:
</p>
<ul>
<li><a href="http://www.newartisans.com">John Wiegley</a>

</li>
<li><a href="http://members.optusnet.com.au/~charles57/GTD/">Charles Cave</a>

</li>
<li><a href="http://sachachua.com/wp/">Sacha Chua</a>

</li>
<li><a href="http://www.cognition.ens.fr/~guerry/">Bastien Guerry</a>
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-17T18:27+0800</p>
<p class="author">Author: Worg people</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
